import React from 'react';

const Frontcourse = () => {
    return (
        <>
            <div id="front-course">
                <div className="container">
                    <span>Что, как и почему</span>
                    <div className="front-block">
                        <div className="front-block-block11">
                            <h1>О КУРСЕ</h1>
                            <p>Это всё, что ты видишь и кликаешь на сайте или в приложении - картинки, кнопочки, анимации и даже бесячая реклама.</p>
                            <p>Самые главные инструменты frontend разработки сайтов это JavaScript, HTML и CSS.</p>
                            <p>В Кыргызстане фронтенд-разработчики востребованы практически в каждой IT-компании. Это также одно из самых популярных направлений для фриланса и удаленной работы. Все потому, что в современном мире сайт нужен каждому</p>
                        </div>
                        <div className="front-block-block22">
                            <span>Доступ:</span>
                            <h1>Навсегда</h1>
                            <p>В курс входит: </p>
                            <h2>3 модулей 60материалов</h2>
                        </div>
                    </div>

                    <div className="for-block">
                        <div className="for-block-it">
                            <h1>Для кого это </h1>
                            <ul className="for-for">
                                <li>Для людей  с математическим складом ума.</li>
                            </ul>
                        </div>

                        <div className="for-block1">
                            <h1>Вы изучтие</h1>
                            <div className="for-block2">
                                <div>
                                    <ul className="for-for">
                                        <li>HTML</li>
                                        <li>CSS</li>
                                        <li>JavaScript</li>
                                        <li>Soft skills. Нетехнические навыки</li>
                                    </ul>
                                </div>
                                <div>
                                    <ul className="for-for">
                                        <li>Кроссплатформенность и кроссбраузерность</li>
                                        <li>Управление версиями</li>
                                        <li>Тестирование и отладка</li>
                                    </ul>
                                </div>
                            </div>

                        </div>


                    </div>

                    <div className="result">
                        <h1>К каким результатам вас может привести этот курс?</h1>
                        <p>С каждым днем, с каждым месяцем, с каждым годом вы будете физически ощущать, как ваши мечты и цели воплощаются в реальность. И каждый день, каждый год вы будете видеть, что вы живете той жизнью, которую сами для себя выбрали, и именно по тому сценарию, который вы сами для себя создали.</p>
                        <p>  Ваш новый навык планирования изменит вашу жизнь и поможет отточить умение выстраивать дела в правильной последовательности. Сначала вы будете видеть на неделю вперед, потом - на месяц, потом - на год, а потом вы будете видеть весь свой путь. Система планирования Кайдзен позволит вам правильно планировать правильные вещи и увеличить степень контроля над своей жизнью, чтобы сделать её счастливой и успешной.</p>
                        <h1>Учитесь, применяйте полученные на курсе знания и будьте счастливы!</h1>

                        <div className="result-button">
                            <button className="buy-course">Купить курс</button>
                            <button className="buy-course1">Смотреть программу</button>
                        </div>
                    </div>



                </div>

            </div>
        </>
    );
};

export default Frontcourse;